** star 1
 - <2019-12-01 Sun 08:53>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
int main(int argc, char** args) {
  FILE *f = fopen("01.txt", "r");

  int fuelsum = 0;
  int mass = -1;
  while (1 == fscanf(f, "%d\n", &mass)) {
    int fuel = (int) (mass / 3) - 2;
    fuelsum += fuel;
  }
  printf("= %d\n", fuelsum);
}
#+END_SRC

#+RESULTS:
: = 3360301
 - <2019-12-01 Sun 09:00>
** star 2
 - <2019-12-01 Sun>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  int main(int argc, char** args) {
    FILE *f = fopen("01.txt", "r");

    int sum = 0;
    int mass;
    while (1 == fscanf(f, "%d\n", &mass)) {
      int fuelsum = 0;
      while (mass > 0) {
        int fuel = (int) (mass / 3) - 2;
        if (fuel > 0) {
          fuelsum += fuel;
        }
        mass = fuel;
      }
      sum += fuelsum;
    }
    printf("= %d\n", sum);
  }
#+END_SRC

#+RESULTS:
: = 5037595
 - <2019-12-01 Sun 09:05>
** part 1
 - <2019-12-02 Mon 20:19>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  int main(int argc, char **args) {
      int positions[100000];
      FILE *f = fopen("02.txt", "r");

      for (int i = 0; i < 10000; i++) {
          if (fscanf(f, "%d", &positions[i]) != 1) {
              break;
          }
          fscanf(f, ",");
      }

      positions[1] = 12;
      positions[2] = 2;

      // int k = 0;
      // positions[k++] = 1;
      // positions[k++] = 1;
      // positions[k++] = 1;
      // positions[k++] = 4;
      // positions[k++] = 99;
      // positions[k++] = 5;
      // positions[k++] = 6;
      // positions[k++] = 0;
      // positions[k++] = 99;

      // int k = 0;
      // positions[k++] = 1;
      // positions[k++] = 0;
      // positions[k++] = 0;
      // positions[k++] = 0;
      // positions[k++] = 99;

      for (int i = 0; i < 10000; i += 4) {
        if (positions[i] == 99) {
          break;
        } else if (positions[i] == 1) {
          positions[positions[i+3]] = positions[positions[i+1]] + positions[positions[i+2]];
        } else if (positions[i] == 2) {
          positions[positions[i+3]] = positions[positions[i+1]] * positions[positions[i+2]];
        } else {
          printf("Error: %d: %d\n", i, positions[i]);
          return 0;
        }
      }

      printf("= %d\n", positions[0]);
      return 0;
  }
#+END_SRC

#+RESULTS:
: = 4945026

 - 145 too low <2019-12-02 Mon 20:37>
 - 4945026 <2019-12-02 Mon 20:40>
** part 2
 - <2019-12-02 Mon 20:41>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #define MAX 100000

  int run(int program[]) {
    int p[MAX];
    for (int i = 0; i < MAX; i++) {
      p[i] = program[i];
    }

      for (int i = 0; i < 10000; i += 4) {
        if (p[i] == 99) {
          break;
        } else if (p[i] == 1) {
          p[p[i+3]] = p[p[i+1]] + p[p[i+2]];
        } else if (p[i] == 2) {
          p[p[i+3]] = p[p[i+1]] * p[p[i+2]];
        } else {
          printf("Error: %d: %d\n", i, p[i]);
          return 0;
        }
      }
      return p[0];
  }

  int main(int argc, char **args) {
      int positions[MAX];
      FILE *f = fopen("02.txt", "r");

      for (int i = 0; i < 10000; i++) {
          if (fscanf(f, "%d", &positions[i]) != 1) {
              break;
          }
          fscanf(f, ",");
      }

      for (int noun = 0; noun <= 99; noun++) {
        for (int verb = 0; verb <= 99; verb++) {
          positions[1] = noun;
          positions[2] = verb;
          if (run(positions) == 19690720) {
            printf("verb=%d, noun=%d\n", verb, noun);
            printf("= %d\n", 100 * noun + verb);
            return 0;
          }
        }
      }
      printf("Not found!");
      return 0;
  }
#+END_SRC

#+RESULTS:
: verb=96, noun=52
: = 5296

 - 499200 too high <2019-12-02 Mon 20:46>
 - 5296 right answer <2019-12-02 Mon 20:48>
** part 1
 - <2019-12-03 Tue 18:46>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>
  #define BUF 30000
  int main(int argc, char **args) {
    // char grid[BUF][BUF] = { 0 };

    int **grid = (int **) malloc(BUF * sizeof(int *));
    for (int i = 0; i < BUF; i++) {
      grid[i] = (int *) malloc(BUF * sizeof(int));
      for (int j = 0; j < BUF; j++) {
        grid[i][j] = 0;
      }
    }

    FILE *f = fopen("03.txt", "r");
    int x = BUF/2;
    int y = BUF/2;
    while (true) {
      char c;
      int i;
      if (fscanf(f, "%c%d", &c, &i) != 2) {
        break;
      }
      // printf("%c%d\n", c, i);

      for (int j = 0; j < i; j++) {
        if (c == 'L') x--;
        if (c == 'R') x++;
        if (c == 'U') y--;
        if (c == 'D') y++;
        if (y >= BUF || y < 0 || x >= BUF || x < 0) {
          printf("!!! %d,%d\n", x, y);
          return 0;
        }
        grid[y][x] = 1;
        // printf("1 %d,%d\n", x, y);
      }

      fscanf(f, ",");
    }
    fscanf(f, "\n");

    x = y = BUF/2;

    int closestIntersectionDistance = 99999;

    while (true) {
      char c;
      int i;
      if (fscanf(f, "%c%d", &c, &i) != 2) {
        break;
      }

      for (int j = 0; j < i; j++) {
        if (c == 'L') x--;
        if (c == 'R') x++;
        if (c == 'U') y--;
        if (c == 'D') y++;
        if (y >= BUF || y < 0 || x >= BUF || x < 0) {
          printf("!!! %d,%d\n", x, y);
          return 0;
        }
        // printf("2 %d,%d = %d\n", x, y, grid[y][x]);
        if (grid[y][x] == 1) {
          int dist = (x > BUF/2 ? x - BUF/2 : BUF/2 - x) + (y > BUF/2 ? y - BUF/2 : BUF/2 - y);
          if (dist < closestIntersectionDistance) {
            closestIntersectionDistance = dist;
          }
        }
        grid[y][x] = 2;
      }
      fscanf(f, ",");
    }


    printf("= %d\n", closestIntersectionDistance);
    return 0;
  }
#+END_SRC

#+RESULTS:
: = 221

 - 11917 too high <2019-12-03 Tue 19:27>
 - 211 correct <2019-12-03 Tue 19:33>
** part 2
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>
  #define BUF 30000
  int main(int argc, char **args) {
    // char grid[BUF][BUF] = { 0 };

    int **grid = (int **) malloc(BUF * sizeof(int *));
    for (int i = 0; i < BUF; i++) {
      grid[i] = (int *) malloc(BUF * sizeof(int));
      for (int j = 0; j < BUF; j++) {
        grid[i][j] = 0;
      }
    }

    FILE *f = fopen("03.txt", "r");
    int x = BUF/2;
    int y = BUF/2;
    int step = 1;
    while (true) {
      char c;
      int i;
      if (fscanf(f, "%c%d", &c, &i) != 2) {
        break;
      }
      // printf("%c%d\n", c, i);

      for (int j = 0; j < i; j++) {
        if (c == 'L') x--;
        if (c == 'R') x++;
        if (c == 'U') y--;
        if (c == 'D') y++;
        if (y >= BUF || y < 0 || x >= BUF || x < 0) {
          printf("!!! %d,%d\n", x, y);
          return 0;
        }
        if (grid[y][x] == 0) {
          grid[y][x] = step;
        }
        step++;
        // printf("1 %d,%d\n", x, y);
      }

      fscanf(f, ",");
    }
    fscanf(f, "\n");

    x = y = BUF/2;

    int minimumSteps = 999999;

    step = 1;
    while (true) {
      char c;
      int i;
      if (fscanf(f, "%c%d", &c, &i) != 2) {
        break;
      }

      for (int j = 0; j < i; j++) {
        if (c == 'L') x--;
        if (c == 'R') x++;
        if (c == 'U') y--;
        if (c == 'D') y++;
        if (y >= BUF || y < 0 || x >= BUF || x < 0) {
          printf("!!! %d,%d\n", x, y);
          return 0;
        }
        // printf("2 %d,%d = %d\n", x, y, grid[y][x]);
        if (grid[y][x] >= 1) {
          if (grid[y][x] + step < minimumSteps) {
            minimumSteps = grid[y][x] + step;
          }
        }
        step++;
      }
      fscanf(f, ",");
    }


    printf("= %d\n", minimumSteps);
    return 0;
  }
#+END_SRC

#+RESULTS:
: = 18542

 - 18542 correct <2019-12-03 Tue 19:39> 
** part 1
 - <2019-12-04 Wed 18:20>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  int main(int argc, char **args) {
      char s[1024];
      int valids = 0;
      for (int i = 236491; i <= 713787; i++) {
          sprintf(s, "%d", i);
          int foundDuplicate = 0;
          int increasing = 1;
          int prev = s[0];
          for (int j = 1; s[j] != 0; j++) {
              if (prev == s[j]) foundDuplicate = 1;
              if (prev > s[j]) { 
                increasing = 0; 
                break; 
              }
              prev = s[j];
          }
          if (foundDuplicate && increasing) {
              //printf("= %d\n", i);
              valids++;
          }
      }
      printf("= %d\n", valids);
      return 0;
  }
#+END_SRC

#+RESULTS:
: = 1169

 - 1169 correct <2019-12-04 Wed 18:28>
** part 2
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  int main(int argc, char **args) {
      char s[1024];
      int valids = 0;
      for (int i = 236491; i <= 713787; i++) {
      //{ int i = 111122;
          sprintf(s, "%d", i);
          int foundDuplicate = 0;
          int increasing = 1;
          for (int j = 1; s[j] != 0; j++) {
            if (s[j] == s[j-1]) {
              if (j >= 2 && s[j-2] == s[j])
                ; // no
              else if (s[j+1] == s[j])
                ; // no
              else
                foundDuplicate = 1;
            }
            if (s[j-1] > s[j]) {
                increasing = 0; 
                break; 
              }
          }
          if (foundDuplicate && increasing) {
              //printf("= %d\n", i);
              valids++;
          }
      }
      printf("= %d\n", valids);
      return 0;
  }
#+END_SRC

#+RESULTS:
: = 757

 - 487 too low <2019-12-04 Wed 18:30>
 - 1165 too high <2019-12-04 Wed 18:34>
 - 757 right answer <2019-12-04 Wed 18:45>
